print ('введите х-координату точки А')
x1= int ( input())
print ('введите у-координату точки А')
y1 = int ( input()) 
print ('введите х-координату точки В')
x2 = int ( input())
print ('введите х-координату точки B')
y2 = int ( input())
print ('введите х-координату точки C')
x3 = int ( input())
print ('введите х-координату точки C')
y3 = int ( input())
rb= ( ((y1-y2)**2) + ((x1-x2)**2) )**0.5
rc= ( ((y1-y3)**2) + ((x1-x3)**2) )**0.5
if rb<rc:
    print ('B')
    print ('Расстояние от точки А до точки В =', rb)
if rb>rc:
    print ('C')
    print ('Расстояние от точки А до точки C =', rc)
