i = int
j=int
l=int
t=int
print ('введите целое число от 100 до 999')
k = int ( input ())
a=k//100
b=(k//10)%10
c=k%10

p=['сто','двести','триста','четыреста','пятьсот','шестьсот','семьсот','восемьсот','девятьсот']
m=['двадцать','тридцать','сорок','пятьдесят','шестьдесят','семьдесят','восемьдесят','девяносто']
n=['один','два','три','четыре','пять','шесть','семь','восемь','девять']
d=['одиннадцать','двенадцать','тринадцать','четырнадцать','пятнадцать','шестнадцать','семнадцать','восемнадцать','девятнадцать']


if b==0:
    for i in range (1,11):
        if a==i:
            if c==0:
                print (p[i-1])
            else:
                for l in range (1,10):
                    if a==i:
                        if c==l:
                            print (p[i-1],n[l-1])
if b==1:
    for i in range (1,11):
        if a==i:
            if c==0:
                print (p[i-1],'десять')
            else: 
                for t in range (1,11):
                    if a==i:
                        if c==t:
                            print (p[i-1],d[t-1])
else:
    for i in range (1,11):
        for j in range (1,10):
            if a==i:
                if b==j:
                    if c==0:
                        print (p[i-1],m[j-2])
                    else:
                        for l in range (1,11):
                            if a==i:
                                if ((b==j) and (b!=0) and (b!=1)):
                                    if c==l:
                                        print (p[i-1],m[j-2],n[l-1])
                
        
